[
  {
    "title": "Why GPS fails in cities. And how it was brilliantly fixed",
    "link": "https://www.sciencedaily.com/releases/2025/10/251009033124.htm",
    "date": "Thu, 09 Oct 2025 03:31:24 EDT",
    "summary": "Our everyday GPS struggles in “urban canyons,” where skyscrapers bounce satellite signals, confusing even advanced navigation systems. NTNU scientists created SmartNav, combining satellite corrections, wave analysis, and Google’s 3D building data for remarkable precision. Their method achieved accuracy within 10 centimeters during testing. The breakthrough could make reliable urban navigation accessible and affordable worldwide.",
    "source": "ScienceDaily AI & Robotics"
  },
  {
    "title": "These little robots literally walk on water",
    "link": "https://www.sciencedaily.com/releases/2025/10/251003033930.htm",
    "date": "Sat, 04 Oct 2025 10:26:35 EDT",
    "summary": "HydroSpread, a breakthrough fabrication method, lets scientists build ultrathin soft robots directly on water. These tiny, insect-inspired machines could transform robotics, healthcare, and environmental monitoring.",
    "source": "ScienceDaily AI & Robotics"
  },
  {
    "title": "Quantum chips just proved they’re ready for the real world",
    "link": "https://www.sciencedaily.com/releases/2025/09/250927031230.htm",
    "date": "Sun, 28 Sep 2025 07:00:14 EDT",
    "summary": "Diraq has shown that its silicon-based quantum chips can maintain world-class accuracy even when mass-produced in semiconductor foundries. Achieving over 99% fidelity in two-qubit operations, the breakthrough clears a major hurdle toward utility-scale quantum computing. Silicon’s compatibility with existing chipmaking processes means building powerful quantum processors could become both cost-effective and scalable.",
    "source": "ScienceDaily AI & Robotics"
  },
  {
    "title": "Caltech’s massive 6,100-qubit array brings the quantum future closer",
    "link": "https://www.sciencedaily.com/releases/2025/09/250925025341.htm",
    "date": "Thu, 25 Sep 2025 05:09:25 EDT",
    "summary": "Caltech scientists have built a record-breaking array of 6,100 neutral-atom qubits, a critical step toward powerful error-corrected quantum computers. The qubits maintained long-lasting superposition and exceptional accuracy, even while being moved within the array. This balance of scale and stability points toward the next milestone: linking qubits through entanglement to unlock true quantum computation.",
    "source": "ScienceDaily AI & Robotics"
  },
  {
    "title": "AI-powered smart bandage heals wounds 25% faster",
    "link": "https://www.sciencedaily.com/releases/2025/09/250924012232.htm",
    "date": "Wed, 24 Sep 2025 10:37:47 EDT",
    "summary": "A new wearable device, a-Heal, combines AI, imaging, and bioelectronics to speed up wound recovery. It continuously monitors wounds, diagnoses healing stages, and applies personalized treatments like medicine or electric fields. Preclinical tests showed healing about 25% faster than standard care, highlighting potential for chronic wound therapy.",
    "source": "ScienceDaily AI & Robotics"
  },
  {
    "title": "Scientists just made atoms talk to each other inside silicon chips",
    "link": "https://www.sciencedaily.com/releases/2025/09/250920214318.htm",
    "date": "Sun, 21 Sep 2025 02:01:58 EDT",
    "summary": "Researchers at UNSW have found a way to make atomic nuclei communicate through electrons, allowing them to achieve entanglement at scales used in today’s computer chips. This breakthrough brings scalable, silicon-based quantum computing much closer to reality.",
    "source": "ScienceDaily AI & Robotics"
  }
]